[
  {
    "patternId": "secret",
    "title": "Secret detection",
    "description": "Detects secrets that should not be committed to a repository or otherwise disclosed, such as secret keys, passwords, and authentication tokens from multiple products."
  },
  {
    "patternId": "vulnerability_critical",
    "title": "Insecure dependencies detection (critical severity)",
    "description": "Detects insecure dependencies (critical severity) by checking the libraries declared in the package manager and flagging used library versions with known security vulnerabilities."
  },
  {
    "patternId": "vulnerability_high",
    "title": "Insecure dependencies detection (high severity)",
    "description": "Detects insecure dependencies (high severity) by checking the libraries declared in the package manager and flagging used library versions with known security vulnerabilities."
  },
  {
    "patternId": "vulnerability_medium",
    "title": "Insecure dependencies detection (medium severity)",
    "description": "Detects insecure dependencies (medium severity) by checking the libraries declared in the package manager and flagging used library versions with known security vulnerabilities."
  },
  {
    "patternId": "vulnerability_minor",
    "title": "Insecure dependencies detection (minor severity)",
    "description": "Detects insecure dependencies (minor severity) by checking the libraries declared in the package manager and flagging used library versions with known security vulnerabilities."
  },
  {
    "patternId": "malicious_packages",
    "title": "Malicious packages detection",
    "description": "Detects malicious packages identified in the OpenSSF Malicious Packages database, including typosquatting attacks, dependency confusion, and packages with malicious payloads."
  },
  {
    "patternId": "eol_critical",
    "title": "End-of-life package (obsolete)",
    "description": "Detects packages that have reached end-of-life and are no longer supported. These dependencies no longer receive security updates and should be upgraded."
  },
  {
    "patternId": "eol_high",
    "title": "End-of-life package (within 1 month)",
    "description": "Detects packages that will reach end-of-life within one month. Plan to upgrade before support ends."
  },
  {
    "patternId": "eol_medium",
    "title": "End-of-life package (within 6 months)",
    "description": "Detects packages that will reach end-of-life within six months. Consider upgrading to a supported version."
  },
  {
    "patternId": "eol_minor",
    "title": "End-of-life package (beyond 6 months)",
    "description": "Detects packages that will reach end-of-life in more than six months. Track for future upgrade planning."
  }
]